{
  "blogs": [
    {
      "title": "An illusion of scale",
      "body": "Successful small businesses often stumble when they seek to get to an entirely different scale.\n\nIt’s easy to believe that things are dramatically better when there’s more.\n\nMore customers, more employees, more market share.\n\nAnd it’s easy to believe that getting to the next sustainable level is simply the result of efforts similar to the ones that got you here.\n\nBut neither is true.\n\nBetween this level and the one you seek there may be a slog that’s longer, more difficult and more expensive than it appears.\n\nStaying at a scale that’s working isn’t a cowardly copout. It might be the single best way to do work that matters for people who care.\n\nAnd if you choose to get through the Dip, consider whether you have the resources, the patience and the team to get to the other side.\n\nWritten by: https://seths.blog/",
      "author": "luigi",
      "id": 11
    },
    {
      "title": "Half of Canadian parents will vaccinate kids 5-11 immediately: survey",
      "body": "\n\nA3pfamily/Shutterstock\nA new national survey suggests half of Canadian parents are keen to immunize their school-aged kids as soon as COVID-19 vaccines become available, but another quarter say they won’t get their kids the shot at all.\n\nVaccines are only approved for use on kids age 12 and up, but that could change soon, because Pfizer submitted a request to Health Canada on Monday to make its vaccine available to children as young as five.\n\nA new poll from Angus Reid found 51% of parents surveyed said they would immunize their five to 11-year-old children as soon as possible.\n\nThe eagerness to vaccinate was even higher among parents whose household income was above $100,000 (59%), and among parents who had a university education (63%).\n\nAt the same time, many parents said they’re hesitant to immunize their young children. Nearly a quarter of parents surveyed (23%) said they would not immunize their five to 11-year-old kids.\n\nParents from lower income households were also less likely to say they wanted to immunize their children. Only 38% of parents from households with less than $50,000 in annual income said they wanted COVID-19 vaccines for their kids.\n\nTaken from: https://dailyhive.com/vancouver/canadian-parents-vaccinate-kids-5-11-immediately",
      "author": "mario",
      "id": 12
    },
    {
      "title": "13 cozy BC cabins to rent for a getaway close to home",
      "body": "We British Columbians are blessed with a beautiful backyard, and now is the perfect time to explore it since the pandemic is still making international travel difficult.\n\nVacations may not be warm or tropical this year, but luckily cabin getaways are still on the menu.\n\nIn The Bluff – Galiano Island’s Log House\nInTheBluff – Galiano Island’s Log House/Airbnb\n\nThis impressive structure boasts a waterfront view on a peaceful yet easy-to-access Gulf Island. Just one ferry from Tsawwassen will transport you to Galiano, and this log cabin offers epic views and lots of space to unwind after visiting local beaches and hiking trails. Did we mention it has an infinity hot tub?\n\nRustic cabin in the woods\nRustic cabin in the woods/Airbnb\n\nA smaller and more rustic Galiano Island perfect for a romantic getaway. The quaint property features a full kitchen, an outhouse, and an outdoor shower. Trails from the property connect guests with nearby pebble beaches.\n\nThe Birdhouse\n\nThis designer treehouse offers guests a serene and elevated experience in Chilliwack. It sits on a fully fenced acre of land and includes a campfire area, a hammock, and outdoor shower. The south-facing deck offers the perfect opportunity to spot wildlife. This Airbnb also has a flush toilet — a luxury for treehouse-style accommodations.\n\nAlfie the A-Frame\nAlfie the A-Frame/AirBnB\n\nThis property is one of the most wish-listed Airbnbs in all of Canada. The loft cabin on the Sunshine Coast has incredible views of Sechelt Inlet and is west-facing to soak up all the afternoon sun and get a front-row seat to spectacular sunsets.\n\nPrivate cottage with ocean views & trail access\nPrivate cottage with ocean views & trail access/Airbnb\n\nEscape to Salt Spring Island in this charming cabin. It’s the most developed of all the Gulf Islands with plenty of attractions and activities, and this Airbnb offers views of the ocean through its floor-to-ceiling windows. It sits on five acres of land, so you’ll be sure to get the peace and quiet you’re looking for.\n\nTotem Chalet\nTotem Chalet/Airbnb\n\nIf you’re in the mood for an active escape, a chalet near one of BC’s famous ski resorts could be right up your alley. This luxurious chalet at Whistler has a private hot tub, gorgeous views, a billiards table, a soaker tub in the master bedroom, and plenty of room for your friends to spread out and relax.\n\nUltimate Modern Escape\nUltimate Modern Escape/Airbnb\n\nThis cabin near Golden was designed by architecture firm Form and Forest and can accommodate up to five guests with its sleeping loft. The vaulted ceiling gives guests 180° views of the forest and mountains, and water-loving visitors can also canoe or raft on the Blaeberry River that crosses the property.\n\nBowen Island\nVRBO\n\nIf you want a close-to-home vacation that’s really close to home, check out Bowen Island. It’s only a 15-minute ferry ride from Horseshoe Bay, so close that some islanders even commute to work in downtown Vancouver. Although it’s close to the city, you’ll still get that far-away feeling with beautiful Pacific Ocean vistas, serene hiking trails, and charming local shops.\n\nSee also:\n8 road trips that will make you want to explore BC ASAP\n5 travel bloggers to follow while you daydream about your next trip\nTofino prepares to welcome back tourists as pandemic restrictions ease\nBrowning Pass Place\nBrowning Pass Place/Airbnb\n\nThis quaint cabin near Tofino has a gorgeous deck on which to enjoy the great outdoors. It’s close enough to all the attractions in Tofino, including gorgeous beaches, surfing, and restaurants, but is secluded in the woods.\n\nTofino’s Heron House\nTofino’s Heron House (tofinoheroncottage.com)\n\nThis two-bedroom cabin features an outdoor shower and fire pit, allowing you to enjoy BC’s great outdoors to the maximum (there’s also an indoor bath for colder weather, don’t worry). It’s nestled among cedar trees and ferns, with a wooded path connecting the property to Tofino Inlet.\n\nChardonnay Lakeview Studio\nChardonnay Lakeview Studio (Airbnb)\n\nThis little cabin is situated on an Okanagan vineyard growing grapes for Chardonnay wine. It features a modern interior with a bedroom, living room, and patio. Enjoy views down to the lake and visit the local wineries. If the weather’s warm enough, head to the beach for a swim.\n\nPonderosa Coach House\nRomantic Lakefront Estate, Lake View & Deck/Airbnb\n\nThis romantic getaway to a lakefront estate boasts panoramic views from its two separate decks. Located in Peachland just outside Kelowna, use this as a base for wine tastings and hiking nearby Pincushion Mountain. This coach house is attached to a larger estate that accommodates 12 people. Each can be booked individually on Airbnb.\n\nCob Cottage\nCob Cottage/Airbnb\n\nYou’ll have to book in advance, like, really far in advance, for this Mayne Island gem. Its first available dates aren’t until Fall 2022. That’s because it’s Canada’s most-wish-listed property for several years running. The hosts say the “earth cottage” was hand-crafted using local and sustainable materials, and guests can explore the gorgeous beaches, trails, and the local brewery on Mayne Island.",
      "author": "mario",
      "id": 13
    },
    {
      "title": "North Vancouver to be the world's first city to use bitcoin mining for heating",
      "body": "The City of North Vancouver is set to become the first city in the world to use bitcoin mining for building heating needs, specifically for the district energy utility.\n\nAccording to a release, the city-owned Lonsdale Energy Corporation (LEC) has reached a deal with MintGreen, a Burnaby-based clean-tech crypto mining company, to use recovered heat electricity from bitcoin mining to help heat nearly 100 residential and commercial buildings connected to the district energy utility.\n\nTaken from: https://dailyhive.com/vancouver/north-vancouver-bitcoin-mining-heating-lonsdale-energy-corporation",
      "author": "luigi",
      "id": 14
    }
  ]
}